app/views/carts/show.html.erb

SELECT "items".* FROM "items" INNER JOIN "carts_items" ON "items"."id" = "carts_items"."item_id" WHERE "carts_items"."cart_id" = ?  [["cart_id", 1]]
---
  <h1>My cat carts: <%= @cart.id %></h1>
  <% @cart.items.each do |item| %>