app/controllers/carts_controller.rb

  def destroy_item
    item = Item.find(params[:item])
    cart = item.carts.find(@cart.id)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "carts".* FROM "carts" INNER JOIN "carts_items" ON "carts"."id" = "carts_items"."cart_id" WHERE "carts_items"."item_id" = ? AND "carts"."id" = ? LIMIT ?  [["item_id", 1], ["id", 1], ["LIMIT", 1]]

    def check_user
      @cart = Cart.find(params[:id])
      redirect_to root_path unless current_user == @cart.user
      @price = 0
      @cart.items.each { |item| @price += item.price }
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "items".* FROM "items" INNER JOIN "carts_items" ON "items"."id" = "carts_items"."item_id" WHERE "carts_items"."cart_id" = ?  [["cart_id", 1]]