app/controllers/charges_controller.rb

SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
SELECT "items".* FROM "items"
---
	def create
	  cart = Cart.find_by(user_id: current_user.id)
	  Item.all.each do |item|