app/controllers/home_controller.rb

  def index
    @cats = Item.all
    @check = 0;
    Cart.all.each do |cart|
      if cart.user == current_user
        @check = 1
        @cart = cart
        break
      end
    end
    if @check == 0
      @cart = Cart.new
      @cart.user = current_user
      @cart.save
---
SELECT "items".* FROM "items"
SELECT "carts".* FROM "carts"
INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 1], ["created_at", "2018-05-31 10:43:05.246155"], ["updated_at", "2018-05-31 10:43:05.246155"]]

  def set_cats
    @cats = Item.all
---
SELECT "items".* FROM "items"

  def find_cat
    @cat = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 45], ["LIMIT", 1]]