app/controllers/home_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def find_cat
    @cat = Item.find(params[:id])