app/controllers/items_controller.rb

  def show
    @items = Item.all
    @check = 0;
    Cart.all.each do |cart|
---
SELECT "items".* FROM "items"
SELECT "carts".* FROM "carts"